[
  {
    "title": "Overflowing garbage on Road 21",
    "category": "Garbage",
    "location": "Mohakhali, Dhaka",
    "description": "Garbage has not been collected for 5 days, causing bad odor and inconvenience for pedestrians and residents. The piled-up waste is attracting stray animals and creating an unhygienic environment. It has become difficult for locals to commute along this road safely. Immediate waste removal is required to restore cleanliness and public health.",
    "image": "https://i.ibb.co.com/tMkyLX6p/Gemini-Generated-Image-hkna0nhkna0nhkna.png",
    "amount": 200,
    "email": "user1@mail.com",
    "date": "2025-10-26"
  },
  {
    "title": "Broken water pipeline in front of school",
    "category": "Water Issues",
    "location": "Dhanmondi, Dhaka",
    "description": "A major water pipe has burst in front of a local school, flooding the road and making it difficult for students and teachers to commute safely. The leakage is causing wastage of water and damaging the surrounding pavement. Nearby vehicles are slipping due to the water accumulation, posing safety risks. Urgent repair is needed to prevent further inconvenience and hazards.",
    "image": "https://i.ibb.co.com/Yr7BDw3/Broken-water-pipeline-in-front-of-school.png",
    "amount": 500,
    "email": "user2@mail.com",
    "date": "2025-10-27"
  },
  {
    "title": "Blocked drainage near market area",
    "category": "Waste Management",
    "location": "Mirpur 10, Dhaka",
    "description": "The drainage system near the bazar is clogged with accumulated waste and debris, causing foul smells to spread across the market area. Water is stagnating on the roads, making it hard for people to walk or drive. This blockage is also increasing the risk of waterborne diseases among nearby residents. Immediate cleaning and maintenance of the drain are required.",
    "image": "https://i.ibb.co.com/s9LKp2nZ/Gemini-Generated-Image-8sf8908sf8908sf8.png",
    "amount": 350,
    "email": "user3@mail.com",
    "date": "2025-10-28"
  },
  {
    "title": "Tree plantation required in park",
    "category": "Tree Plantation",
    "location": "Uttara Sector 4, Dhaka",
    "description": "The park area has lost most of its greenery and trees, leaving it bare and exposed. Lack of trees reduces shade and contributes to heat buildup, making the park less attractive for visitors. Planting new trees would improve air quality and enhance the aesthetic appeal of the area. A green initiative is needed to restore this community space.",
    "image": "https://i.ibb.co.com/W4TLc4qt/Gemini-Generated-Image-w4hk0vw4hk0vw4hk.png",
    "amount": 800,
    "email": "user4@mail.com",
    "date": "2025-10-29"
  },
  {
    "title": "Plastic waste around lake area",
    "category": "Waste Management",
    "location": "Gulshan Lake, Dhaka",
    "description": "Plastic bottles, wrappers, and other waste are scattered along the lakeside, affecting the beauty and cleanliness of the environment. The pollution is harmful to aquatic life and contributes to water contamination. Visitors and nearby residents are concerned about the health and ecological risks. A cleanup drive and awareness initiative are necessary to maintain the lake’s surroundings.",
    "image": "https://i.ibb.co.com/YFLgvmr3/Gemini-Generated-Image-jjhgdmjjhgdmjjhg.png",
    "amount": 250,
    "email": "user5@mail.com",
    "date": "2025-10-30"
  },
  {
    "title": "Streetlight not working for a week",
    "category": "Infrastructure",
    "location": "Banani Road 11, Dhaka",
    "description": "Several streetlights along this road have been non-functional for a week, creating dark areas that compromise safety at night. Residents and passersby are at risk of accidents or potential criminal activity due to poor lighting. The local authorities need to repair these lights promptly to ensure road safety and security. Proper maintenance will also improve the neighborhood’s livability.",
    "image": "https://i.ibb.co.com/NbXs5Yn/Gemini-Generated-Image-jvlo11jvlo11jvlo.png",
    "amount": 400,
    "email": "user6@mail.com",
    "date": "2025-10-31"
  },
  {
    "title": "Sewage water on roadside",
    "category": "Water Issues",
    "location": "Farmgate, Dhaka",
    "description": "Sewage water is leaking onto the roadside, creating health hazards and spreading foul odor throughout the area. The stagnant sewage increases the risk of mosquito breeding and waterborne diseases. Pedestrians and nearby residents are facing significant inconvenience and hygiene risks. Immediate attention is needed to repair the sewage line and clean the affected road.",
    "image": "https://i.ibb.co.com/Wp62CFW8/Sewage-water-on-roadside.png",
    "amount": 600,
    "email": "user7@mail.com",
    "date": "2025-11-01"
  },
  {
    "title": "Illegal dumping in open field",
    "category": "Garbage",
    "location": "Khilgaon, Dhaka",
    "description": "Residents are illegally dumping garbage in an open field near a residential area, leading to pollution and health hazards. The area is becoming unsightly and attracting pests and stray animals. The accumulation of waste is affecting the quality of life for nearby communities. Authorities should intervene to prevent dumping and organize proper waste disposal.",
    "image": "https://i.ibb.co.com/fzgs9P2G/Illegal-dumping-in-open-fieldpng.png",
    "amount": 300,
    "email": "user8@mail.com",
    "date": "2025-11-02"
  },
  {
    "title": "Need trees beside playground",
    "category": "Tree Plantation",
    "location": "Shyamoli, Dhaka",
    "description": "The playground area is exposed to direct sunlight, making it uncomfortable for children to play during the day. Planting trees beside the playground would provide shade and reduce heat, creating a safer and more enjoyable environment. Greenery would also improve air quality and aesthetic appeal. Local community engagement is recommended for tree plantation projects.",
    "image": "https://i.ibb.co.com/rK4Cc3WV/Need-trees-beside-playground.png",
    "amount": 900,
    "email": "user9@mail.com",
    "date": "2025-11-03"
  },
  {
    "title": "Overflowing dustbins near hospital",
    "category": "Garbage",
    "location": "Kalyanpur, Dhaka",
    "description": "Dustbins near the hospital are overflowing, producing bad odor and creating a potential health risk for patients and visitors. The waste is attracting flies, insects, and stray animals. Regular collection and proper disposal are urgently needed to maintain hygiene in this sensitive area. Immediate action would ensure cleanliness and reduce health hazards.",
    "image": "https://i.ibb.co.com/BHXQ47m8/Overflowing-dustbins-near-hospital.png",
    "amount": 220,
    "email": "user10@mail.com",
    "date": "2025-11-04"
  },
  {
    "title": "Water logging after rain",
    "category": "Water Issues",
    "location": "Rampura, Dhaka",
    "description": "Even light rain causes waterlogging on the streets due to poorly maintained drainage systems. The stagnant water disrupts traffic and pedestrian movement, and increases the risk of waterborne diseases. Local residents face inconvenience and property damage during monsoon. Immediate drainage maintenance and proper planning are needed to prevent recurring issues.",
    "image": "https://i.ibb.co.com/Gf9gNwjy/mumbai-waterlogging-express.webp",
    "amount": 550,
    "email": "user11@mail.com",
    "date": "2025-11-05"
  },
  {
    "title": "Overflowing drain causing mosquito issues",
    "category": "Waste Management",
    "location": "Tejgaon, Dhaka",
    "description": "A drain has been overflowing for several days, leading to stagnant water that attracts mosquitoes and spreads foul odor. Nearby residents are experiencing health risks such as mosquito-borne diseases. The stagnant water is also creating unsanitary conditions and reducing overall neighborhood hygiene. Urgent cleaning and repair of the drainage system is necessary.",
    "image": "https://i.ibb.co.com/5WXdN3N0/mosquito-planning.jpg",
    "amount": 450,
    "email": "user12@mail.com",
    "date": "2025-11-06"
  }
]
